new Swiper('.image-slider', {
  // стрелки
  navigation: {
    nextEl: '.swiper-button-next',
    prevEl: '.swiper-button-prev',
  },

  //* Навигация

  pagination: {
    el: '.swiper-pagination',
    //* ================================================ БУЛЛЕТЫ ========================================================================//
    //Буллеты
    type: 'bullets',
    clickable: true,
    // Динамичесские буллеты
    dynamicBullets: true,
    // Кастомные буллеты
    renderBullet: function (index, className) {
      return '<span class="' + className + '">' + (index + 1) + '</span>';
    },
    // ================================================ БУЛЛЕТЫ ========================================================================//

    //* ================================================ ФРАКЦИИ ========================================================================//
    // Фракции
    // type: 'fraction',
    // Кастомный вывод фракций
    // renderFraction: function (currentClass, totallClass) {
    //   return 'Фото <span class="'+ currentClass +'"></span>' + ' из ' + '<span class="' + totallClass +'"></span>';
    // },
  },
  // ================================================ ФРАКЦИИ ========================================================================//
  //* ================================================ ПРОГРЕССБАР ========================================================================//
  // type: 'progressbar'
  // ================================================ ПРОГРЕССБАР ========================================================================//

  //* ================================================ СКРОЛ ========================================================================//
  scrollbar: {
    el: '.swiper-scrollbar',
    // Возможность перетаскивать скролл
    draggable: true,
  },
  // ================================================ СКРОЛ ========================================================================//
  //* ================================================ ВКЛЮЧЕНИЕ/ОТКЛЮЧЕНИЕ ========================================================================//
  // Перетаскивание на ПК
  simulateTouch: true,
  // Чувствительность свайпа
  touchRatio: 1,
  // Угол срабатывания свайпа/перетаскивания
  touchAngel: 45,
  // Курсор перетаскивания
  grabCursor: true,
  // Переключение при клике на слайд
  slideTouchClickedSlide: true,
  // ================================================ ВКЛЮЧЕНИЕ/ОТКЛЮЧЕНИЕ ========================================================================//
  //* ================================================ НАВИГАЦИЯ ПО ХЭШУ ========================================================================//
  hashNavigation: {
    // Отслеживать состояние
    watchState: true,
  },
  // ================================================ НАВИГАЦИЯ ПО ХЭШУ ========================================================================//
  //* ================================================ УПРАВЛЕНИЕ КЛАВИАТУРОЙ ========================================================================//
  keyboard: {
    // Включить/выключить
    enablet: true,
    // Включить/выключить только когда слайдер в пределах вьюпорта
    onlyInViewport: true,

    // Включить/выключить упрравление клавишами PageUp PageDown
    pageUpDown: true,
  },
  // ================================================ УПРАВЛЕНИЕ КЛАВИАТУРОЙ ========================================================================//
  //* ================================================ УПРАВЛЕНИЕ КОЛЕСОМ МЫШИ ========================================================================//
  mousewheel: {
    // Чувствительность колеса мыши
    sensitivity: 1,
    // класс объекта на которм будет срабатывать прокрутка мышью
    eventsTarget: '.image-slider',
  },
  // ================================================ УПРАВЛЕНИЕ КОЛЕСОМ МЫШИ ========================================================================//
  //* ================================================ АВТОВЫСОТА СЛАЙДА ========================================================================//
  autoHeight: true, // Отключить при выборе slidesPerColumn: 2,
  // ================================================ АВТОВЫСОТА СЛАЙДА ========================================================================//
  //* ================================================ КОЛИЧЕСТВО СЛАЙДОВ ДЛЯ ПОКАЗА ========================================================================//
  // количество слайдов для показа
  // slidesPerView: 2,
  // Отключение функционала если слайдов меньше чем нужно
  watchOverflow: true,
  // Отступ между слайдерами
  spaceBetween: 30,
  // Количество пролистываемых слайдов
  slidesPerGroup: 1,
  // Активный слайд по центру
  centeredSliders: true,
  // Стартовый слайд
  initialSlide: 0,
  // Мультирядность
  slidesPerColumn: 1, // отключить autoHeight: true
  // Бесконечное прокручивание слайдов
  loop: false,
  // Количество дудлирующих слайдов
  loopedSlides: 0,
  // Свободный режим
  freeMade: 0,
  //* ================================================ АВТОПРОКРУТКА ========================================================================//
  // autoplay:{
  //   // Пауза между прокруткой
  //   delay: 1000,
  //   // Закончить на последнем слайде
  //   stopOnLasSlide: true,
  //   // Отключить после ручного переключения
  //   disableOnInteraction: false
  // },
  // ================================================ АВТОПРОКРУТКА ========================================================================//
  //* Скорость прокрутки слайдов
  speed: 800,
  // ================================================ КОЛИЧЕСТВО СЛАЙДОВ ДЛЯ ПОКАЗА ========================================================================//
  //* ================================================ ВЕРТИКАЛЬНЫЙ СЛАЙДЕР ========================================================================//
  // direction: 'vertical',
  direction: 'horizontal',
  // ================================================ ВЕРТИКАЛЬНЫЙ СЛАЙДЕР ========================================================================//
  //* ================================================ ЭФФЕКТЫ ПЕРЕКЛЮЧЕНИЯ СЛАЙДОВ ========================================================================//
  //* Листание */
  effect: 'slide',

  // дОПОЛНЕНИЕ К SLIDE
  // breakpoints: {
  //   320: {
  //     slidesPerView: 1,
  //   },
  //   480: {
  //     slidesPerView: 2,
  //   },
  //   992: {
  //     slidesPerView: 3,
  //   },
  // },

  //* //Смена прозрачности */
  // effect: 'fade',
  // // Дополнение к прозрачности
  // fadeEffect: {
  //   crossFade: true // Параллельная смена прозрачности
  // },

  //* Переворот */
  // effect: 'flip',
  // // Дополнение к flip
  // flipEffect: {
  //   slideShadows: true, // Тень
  //   limitRotation: true // Показ только активного слайда
  // },
  //* Еффект Куба */
  //   effect: 'cube',
  //   // Дополнение к cube
  // cubeEffect: {
  // // Настройки тени
  //   slideShadows: true,
  //   shadow: true,
  //   shadowOffset: 20,
  //   shadowScale: 0.94
  // },

  // * Еффект потока
  // effect: 'coverFlow',
  // // Дополнение к cjverFlow
  // coverflowEffect: {
  //   rotate: 20, // угол
  //   stretch: 50, // наложение
  //   slideShadows: true, // тень
  // },
  // ================================================ ЭФФЕКТЫ ПЕРЕКЛЮЧЕНИЯ СЛАЙДОВ ========================================================================//
});
